/*
 * Copyright (C) Huawei Technologies Co., Ltd. 2012-2015. All rights reserved.
 * foss@huawei.com
 *
 * If distributed as part of the Linux kernel, the following license terms
 * apply:
 *
 * * This program is free software; you can redistribute it and/or modify
 * * it under the terms of the GNU General Public License version 2 and 
 * * only version 2 as published by the Free Software Foundation.
 * *
 * * This program is distributed in the hope that it will be useful,
 * * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * * GNU General Public License for more details.
 * *
 * * You should have received a copy of the GNU General Public License
 * * along with this program; if not, write to the Free Software
 * * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA
 *
 * Otherwise, the following license terms apply:
 *
 * * Redistribution and use in source and binary forms, with or without
 * * modification, are permitted provided that the following conditions
 * * are met:
 * * 1) Redistributions of source code must retain the above copyright
 * *    notice, this list of conditions and the following disclaimer.
 * * 2) Redistributions in binary form must reproduce the above copyright
 * *    notice, this list of conditions and the following disclaimer in the
 * *    documentation and/or other materials provided with the distribution.

*****************************************************************************/
typedef enum
{
    BBP_DUMP_OK = 0,              /* ???????? */
    BBP_DUMP_MEM_SMALL,           /* ???????????????? */
    BBP_DUMP_MEM_BIG,             /* ????????????????*/
    BBP_DUMP_MEM_NOT_32KB,        /* ??32kB???????? */
    BBP_DUMP_ALLOC_MEM_ERR,       /* ???????????????? */
    BBP_DUMP_START_EDMA_ERR,      /* ????EDMA???? */
    BBP_DUMP_ACORE_MSG_NULL,      /* A????????MSG???? */
    BBP_DUMP_END,                 /* ???????? */
    BBP_DUMP_READ_NV_ERR,         /* ??NV???? */
    BBP_DUMP_DISABLE,             /* NV??????BBP????*/
    BBP_DUMP_STOP_EDMA_ERR,       /* ????EDMA???? */
    BBP_DUMP_MODE_ERR,            /* ???????? */
    BBP_DUMP_WAITING_CNF_TIMEOUT, /* ???????????? */
    BBP_DUMP_RCV_MSG_NOT_MATCH,   /* ?????????????? */
    BBP_DUMP_BUTT
}OM_APP_BBP_DUMP_ERRCODE_ENUM;

typedef VOS_UINT32 OM_APP_BBP_DUMP_ERRCODE_ENUM_U32;

/*****************************************************************************
??????    : OM_APP_BBP_EDMA_ERR_ENUM
????????  : ????EDMA??????????????????????????????????????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????????
*****************************************************************************/
typedef enum
{
    OM_BBP_DUMP_EDMA_ERR = 0, /* ????EDMA???? */
    OM_BBP_DBG_EDMA_ERR,      /* ????????EDMA???? */
    OM_BBP_EDMA_ERR_BUTT
}OM_APP_BBP_EDMA_ERR_ENUM;

typedef VOS_UINT16 OM_APP_BBP_EDMA_ERR_ENUM_U16;

/*****************************************************************************
??????    : OM_BBP_DUMP_ENABLE_ENUM
????????  : NV ??????????????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????????
*****************************************************************************/
typedef enum
{
    OM_BBP_DUMP_DISABLE = 0, /* ???????? */
    OM_BBP_DUMP_ENABLE,      /* ???????? */
    OM_BBP_DUMP_BUTT
}OM_BBP_DUMP_ENABLE_ENUM;

typedef VOS_UINT16 OM_BBP_DUMP_ENABLE_ENUM_U16;

/*****************************************************************************
  4 ????????????
*****************************************************************************/


/*****************************************************************************
  5 ??????????
*****************************************************************************/

/*****************************************************************************
  6 ????????
*****************************************************************************/


/*****************************************************************************
  7 STRUCT????
*****************************************************************************/
/*****************************************************************************
??????    : BBP_DBG_SOCP_INFO_STRU
????????  : BBP DBG SOCP????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_UINT32  ulWriteDoneOk;      /* ???????????????? */
    VOS_UINT32  ulWriteDoneErr;     /* ???????????????? */
    VOS_UINT32  ulGetWriteBuffErr;  /* ??????????buffer?????????? */
    VOS_UINT32  ulBuffNotEnough;    /* ?????????????????? */
    VOS_UINT32  ulWriteBufSize;     /* ???????????????? */
}BBP_DBG_SOCP_INFO_STRU;

/*****************************************************************************
??????    : BBP_DBG_ERR_INFO_STRU
????????  : BBP DBG ????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_UINT16                  usAllocErr;                                 /* ???????????????? */
    VOS_UINT16                  usInitSocpErr;                              /* ??????????SOCP???? */
    VOS_UINT16                  usStartSocpErr;                             /* ????????SOCP???? */
    VOS_UINT16                  usInitEdmaErr;                              /* ????EDMA?????????? */
    VOS_UINT16                  usConfigEdmaErr;                            /* ????EDMA???????? */
    VOS_UINT16                  usEdmaErrCode;                              /* ????EDMA???????????????? */
    VOS_UINT16                  usAllocCycErr;                              /* ????????EDMA???????????????? */
    VOS_UINT16                  usGetConAddrErr;                            /* ????????EDMA????????????*/
    VOS_UINT16                  usStartEdmaErrNum;                          /* ????????EDMA?????????? */
    VOS_UINT16                  usStopEdmaErrNum;                           /* ????EDMA???? */
    VOS_UINT16                  usCreateSemErr;                             /* ?????????????? */
    VOS_UINT16                  usRev;
    BBP_DBG_SOCP_INFO_STRU      astBbpDbgSocpInfo[BBP_DBG_CODER_SRC_NUM];   /* ????SOCP?????????? */
}BBP_DBG_ERR_INFO_STRU;

/*****************************************************************************
??????    : BBP_DBG_INFO_STRU
????????  : BBP DBG ????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_INT                             lBbpEdmaChanID;                         /* ????????????EDMA?????? */
    VOS_UINT32                          ulBbpDbgStatus;                         /* ??????????????????*/
    VOS_UINT32                          ulBbpErrCode;                           /* ????BBP???????????????????? */
    VOS_UINT32                          ulBbpSelfTaskNum;                       /* ???????????????????????? */
    VOS_UINT32                          ulBbpEdmaCallBackNum;                   /* ????BBP????????EDMA ???????????? */
    VOS_UINT32                          ulPhyAddr;                              /* ?????????????????????? */
    VOS_UINT32                          ulIndexValue;                           /* ?????? */
    VOS_UINT32                          ulLastAddr;                             /* EDMA???????????????????? */
    VOS_UINT32                          ulFlowNum;                              /* BBP?????????? */
}BBP_DBG_INFO_STRU;

/*****************************************************************************
??????    : BBP_DUMP_ERR_INFO_STRU
????????  : BBP DUMP ????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_UINT16  usInitEdmaErr;  /* ??????EDMA???? */
    VOS_UINT16  usConfigEdmaErr;/* ????EDMA???? */
    VOS_UINT16  usStartEdmaErr; /* ????EDMA???? */
    VOS_UINT16  usEdmaErrCode;  /* ???????????? */
    VOS_UINT16  usAllocMsgErr;  /* ???????????????? */
    VOS_UINT16  usCloseEdmaErr; /* ????EDMA????*/
    VOS_UINT16  usStopEdmaErr;  /* ????EDMA???? */
    VOS_UINT16  usRev;
}BBP_DUMP_ERR_INFO_STRU;


/*****************************************************************************
??????    : BBP_DUMP_CHOOSE_STRU
????????  : BBP DUMP ????????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_UINT32  ulChooseRelt;

}BBP_DUMP_CHOOSE_STRU;

/*****************************************************************************
??????    : OM_APP_BBP_DUMP_EDMA_STRU
????????  : BBP DUMP ????PC????????EDMA????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    OM_APP_BBP_DUMP_ERRCODE_ENUM_U32    enErr;      /* ??????????????????????????????????OK,?????????????????? */
    VOS_UINT32                          ulPhyAddr;
}OM_APP_BBP_DUMP_EDMA_STRU;

/*****************************************************************************
??????    : APP_OM_BBP_DUMP_SET_STRU
????????  : BBP DUMP PC??????W??????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    OM_BBP_DUMP_MODE_ENUM_U32               enMode;             /* 0x5E820334????????G??????W?? */
    VOS_UINT32                              ulDataLen;          /* 0x014c ?????????????? ??0??????????,PC??????????KByte?????? */

    /* W???????? start */
    BBP_DUMP_FIFO_WATERMARKER_ENUM_U32      enFifoWaterW;       /* 0x0154 ???????????? */
    VOS_UINT32                              ulStartTimeW;       /* 0x0150 ???????????? */
    VOS_UINT32                              ulDataModelSelW;    /* 0x12dc DMA???????????????? */
    VOS_UINT32                              ulWtDbgEnW;         /* 0x96000 DBG????????????????*/
    /* W???????? end */

    /* G???????? start */
    VOS_UINT32                              ulStartLowTimeG;    /* 0xf00c ???????????? */
    VOS_UINT32                              ulStartHiTimeG;     /* 0xf010 ???????????? */
    VOS_UINT32                              ulGenConfig;        /* 0xF004 G?????????? */
    /* G???????? end */
}APP_OM_BBP_DUMP_SET_STRU;

/*****************************************************************************
??????    : BBP_DUMP_GET_FIX_DDR_ADDR
????????  : ????????????????????????????????

  1.??    ??   : 2014??10??08??
    ??    ??   : d00212987
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_UINT32                          ulPhyAddr;    /* ????BBP??????????EDMA?????? */
    VOS_UINT32                          ulPhySize;    /* ???????????? */
}BBP_DUMP_GET_FIX_DDR_ADDR;

/*****************************************************************************
??????    : BBP_DUMP_MSG_STRU
????????  : ????????????????????????????????

  1.??    ??   : 2014??10??08??
    ??    ??   : d00212987
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    VOS_UINT16                          usPrimId;
    VOS_UINT16                          ausRsv[3];
    BBP_DUMP_GET_FIX_DDR_ADDR           stDumpDdrInfo;
}BBP_DUMP_MSG_STRU;

/*****************************************************************************
??????    : APP_OM_BBP_DBG_SET_W_STRU
????????  : BBP ???????? PC??????????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    OM_BBP_DUMP_MODE_ENUM_U32           enMode;             /* 0x5E820334????????G??????W?? */
    OM_BBP_STATUS_ENUM_U32              enStatus;           /* ????????????BBP DBG???? */
    BBP_DBG_IF_SEL_ENUM_U32             enBBPIfSel;         /* 0x008 ????BBP????????????*/
    BBP_DBG_CLK_IN_SEL_ENUM_U32         enClkInSel;         /* 0x010 DBG???????????? */
    VOS_UINT32                          ulTimeSel;          /* 0x01c ?????????????????????? */
    VOS_UINT32                          ulMaskAddrStart0;   /* 0x020 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrEnd0;     /* 0x024 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrStart1;   /* 0x028 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrEnd1;     /* 0x02c ?????????????????????? */
    VOS_UINT32                          ulMaskAddrStart2;   /* 0x030 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrEnd2;     /* 0x034 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrStart3;   /* 0x038 ?????????????????????? */
    VOS_UINT32                          ulMaskAddrEnd3;     /* 0x03c ?????????????????????? */
    BBP_DBG_FIFO_WATERMARKER_ENUM_U32   enFifoWater;        /* 0x040 DBG FIFO???????? */
    VOS_UINT32                          ulDbgSwitch;        /* 0x044 DBG???????????? ??????????1????2?????????????? 0x008??0x010*/
}APP_OM_BBP_DBG_SET_W_STRU;

/*****************************************************************************
??????    : BBP_DUMP_INFO_STRU
????????  : ????BBP????????

  1.??    ??   : 2012??11??06??
    ??    ??   : j00174725
    ????????   : BBP????????
*****************************************************************************/
typedef struct
{
    VOS_INT                             lEdmaChanID;    /* ????BBP??????????EDMA?????? */
    VOS_UINT16                          usDUMPStatus;   /* ???????????? */
    VOS_UINT16                          usDUMPDone;     /* EDMA???????????? */
    VOS_UINT16                          usDUMPMode;     /* ?????????????????? */
    VOS_UINT16                          usRev;
    VOS_UINT32                          ulPhyAddr;      /* ????DRV??????DUMP???????? */
